title: applescript malicious signing of Ledger Wallet app
description: Detects MacSync signing Ledger Wallet app via codesign
author: IzzyBoop
date: 2025/01/15
status: experimental
logsource:
    product: macos
    service: process_creation
detection:
    selection:
        CommandLine|contains:
            - 'codesign'
            - 'Ledger Wallet.app'
    condition: selection