title: MacOS Digit Stealer Curling Further Payloads
description: Detects Digit Stealer Curling Second Stage Payloads
id: 0b9e1c49-ba9d-486a-a27e-1ce2363fb8fd
status: experimental
author: IzzyBoop
date: 2025/11/20
logsource:
  product: macos
  category: process_creation
detection:
  selection_1:
    ParentImage|endswith: 'bash' 
    CommandLine|contains|all:
      - 'curl'
      - '-fsSL'
  selection_2:
    ParentImage|endswith: 'bash'
    CommandLine: # Look for the commands with the same group id as these results. This captures "[command] | osascript", etc.
      - 'osascript'
      - 'osascript -l Javascript'
  condition: selection_1 or selection_2

