title: MacOS Digit Stealer - app.asar Creation
description: Detects activity from the script that creates the app.asar Ledger Live file from three separate pieces
id: 960a5e05-2ce9-475d-a8e9-e4047d5dd1e3
status: experimental
author: IzzyBoop
date: 2025/11/20
logsource:
  product: macos
  category: process_creation

detection:
  selection_1:
    ParentImage|endswith: '/osascript'
    CommandLine|contains|all:
      - 'sh -c'
      - 'osascript -e'
      - 'set volume with output muted'

  selection_2:
    ParentImage|endswith: '/osascript'
    CommandLine|contains|all:
      - 'sh -c'
      - 'mkdir -p'
      - '/tmp/downloaded_parts'

  selection_3:
    ParentImage|endswith: '/osascript'
    CommandLine|contains|all:
      - 'sh -c'
      - 'rm -f'
      - '/tmp/app.asar.zip'

  selection_4:
    ParentImage|endswith: '/osascript'
    CommandLine|contains|all:
      - 'sh -c'
      - 'curl'
      - '--max-time'
      - '--retry'
      - '--retry-delay'
      - '--retry-max-time'
      - '-f -C - -o'

  selection_5:
    ParentImage|endswith: '/osascript'
    CommandLine|contains|all:
      - 'sh -c'
      - 'cat'
      - '/tmp/downloaded_parts/'
      - '>>'
      - '/tmp/app.asar.zip'

  selection_6:
    ParentImage|endswith: '/osascript'
    CommandLine|contains|all:
      - 'sh -c'
      - 'cd'
      - '/tmp'
      - '&&'
      - 'unzip -o'
      - '/tmp/app.asar.zip'

  selection_7:
    ParentImage|endswith: '/osascript'
    CommandLine|contains|all:
      - 'sh -c'
      - 'killall'
      - 'Ledger Live'
      - '|| true'

  selection_8:
    ParentImage|endswith: '/osascript'
    CommandLine|contains|all:
      - 'sh -c'
      - 'rm -rf'
      - '/tmp/downloaded_parts/'

  condition: 1 of selection_*
