title: macOS Phexia Stealer password UTF convert
description: Detects two separate commands to printf password and iconv convert, must be correlated.
status: experimental
author: IzzyBoop
date: 2025/12/26
logsource:
  product: macos
  category: process_creation
detection:
  selection_1: 
  # selection 1 and 2 capture: sh -c printf %s 'password' | iconv -f UTF-8 -t UTF-8 | base64
    CommandLine|contains|all: 
      - 'sh -c'
      - 'printf %s'
      - 'password'
  selection_2:
    CommandLine|contains|all: 
      - 'iconv'
      - '-f UTF-8'
      - '-t UTF-8'
  condition: 1 of selection_* 
  # Due to the nature of how piped commands manifest in macOS logs, these two selections must be correlated externally to confirm the full command execution. Look for instances of `sh -c printf %s 'password'` and `iconv -f UTF-8 -t UTF-8` within a close time frame. (Like within 1 second of each other.)