title: MacOS Digit Stealer - Dropper Detection
description: Detects 'Drag Into Terminal.msi' bash dropper.
id: fdfe1adc-244a-4d84-a219-86fbdb38307c
status: experimental
author: IzzyBoop
date: 2025/11/14
logsource:
  product: macos
  category: process_creation
detection:
  selection_1:
    ParentImage|endswith: '/bash'
    CommandLine|contains:
      - 'base64 -d'
      - 'gunzip'
      - 'bash'
  selection_2:
    CommandLine|contains|all:
      - 'curl'
      - '-fsSL'
      - '.pages.dev'
      - '.aspx'
  condition: selection_1 or selection_2