title: MacOS Digit Stealer Curling Further Payloads
description: Detects Digit Dropper Curling Second Stage Payloads
status: experimental
author: IzzyBoop
date: 2025/11/14
logsource:
  product: macos
  category: process_creation
detection:
  selection:
    CommandLine|contains|all:
      - 'nohup'
      - 'curl'
      - '-fsSL'
      - '>/dev/null'
      - '2>&1'
    CommandLine|contains:
      - '| osascript'
      - '| osascript -l JavaScript'
      - '| bash'
  condition: selection

