title: MacOS xattr Quarantine Removal or Attribute Clear
status: experimental
description: Detects the removal of the com.apple.quarantine extended attribute or clearing of other extended attributes on files, which may indicate attempts to bypass security measures.
id: 7164f483-09f1-49ed-8ecc-89136f748788
author: IzzyBoop
date: 2025-10-27
logsource:
  product: macos
  category: process_creation
detection:
  selection_xattr_removal:
    CommandLine|contains|all:
      - 'xattr'
      - '-d'
      - 'com.apple.quarantine'
      # Split to avoid cases where escape characters are used
  selection_xattr_clear:
    CommandLine|contains|all:
      - 'xattr'
      - '-c'
      # Split to avoid cases where escape characters are used
  condition: selection_xattr_removal or selection_xattr_clear
level: medium