title: MacOS Digit Stealer Curling Further Payloads
description: Detects Digit Stealer Curling Second Stage Payloads
status: experimental
author: IzzyBoop
date: 2025/11/14
logsource:
  product: macos
  category: process_creation
detection:
  selection_1:
    CommandLine|contains|all:
      - 'nohup'
      - 'curl'
      - '-fsSL'
      - '>/dev/null'
      - '2>&1'
  selection_2:
    CommandLine|contains|any:
      - '| osascript'
      - '| osascript -l JavaScript'
      - '| bash'
  condition: selection_1 and selection_2

